#+TITLE: EDX How to Code: Simple Data
#+ROAM_KEY: https://www.edx.org/course/how-to-code-simple-data

- tags :: [[file:20200526214234-computer_science.org][computer science]], [[file:20200805181814-data_types.org][data types]],

* How to Design Data (HtDD) Recipe (12 lectures, 5-8 hours)
  :PROPERTIES:
  :Effort:   5:00
  :END:
  :LOGBOOK:
  CLOCK: [2020-08-05 Wed 18:19]--[2020-08-05 Wed 18:45] =>  0:26
  CLOCK: [2020-08-04 Tue 20:27]--[2020-08-04 Tue 20:33] =>  0:06
  CLOCK: [2020-08-04 Tue 17:43]--[2020-08-04 Tue 18:00] =>  0:17
  CLOCK: [2020-08-04 Tue 17:02]--[2020-08-04 Tue 17:09] =>  0:07
  CLOCK: [2020-08-03 Mon 19:47]--[2020-08-03 Mon 20:17] =>  0:30
  CLOCK: [2020-07-27 Mon 17:51]--[2020-07-27 Mon 18:02] =>  0:11
  CLOCK: [2020-07-27 Mon 17:19]--[2020-07-27 Mon 17:23] =>  0:04
  :END:
  Learn to use the HtDD recipe to design data definitions for atomic data.
* How to Design Worlds (HtDW) Recipe (7 lectures, 3-5 hours)
  :PROPERTIES:
  :Effort:   3:00
  :END:
  :LOGBOOK:
  CLOCK: [2020-08-12 Wed 18:22]--[2020-08-12 Wed 18:43] =>  0:21
  :END:
  Leanr how to use the HtDW recipe to design interactive programs with atomic world state

